{"440 BC ": " Herodotus in Histories is the first to mention Dacians as living on the territory of modern-day Romania.", "5th century": "The Geto-Dacian Helmet of Peretu.Cothelas, King of the Getae.", "339": "Rex Histrianorum, ruling over Histria, is mentioned by Trogus Pompeius si Justinus.", "4th century": "The Geto-Dacian Helmet of Facau-Bulbucata.King Dromichaetes ruled both sides of the river Danube.", "King Moskon ruled the northern parts of Dobruja,200 BC": "King Rhemaxos protected Greek colonies in Dobruja.", "100 BC": "King Dicomes ruled Dacia.King Rholes ruled Dobruja.King Dapyx ruled Dobruja.", "82 BC": "King Burebista rules Dacia. (to 44 BC)", "44 BC": "Deceneus is High Priest of Dacia. (to 27 BC)", "40 BC": "King Cotiso ruled Banat and Oltenia. (to 9 BC)", "29 BC": "King Zyraxes ruled northern Dobruja. (to 27 BC)", "9 BC": "King Comosicus ruled Dacia. (to AD 30)", "30": "King Scorilo ruled Dacia. (to 70)", "68": "King Duras ruled Dacia. (to 87)", "86": "Roman Emperor Domitian loses war with the Kingdom of Dacia. (to 88)", "87": "King Decebalus ruled Dacia. (to 106)", "101": "First war between the Roman Empire and Dacia which ended in an unfavorable peace treaty for emperor Trajan. (to 102)", "105": "Peace broken, King Decebalus loses Second Dacian War, the south-west part of Dacia becomes a Roman province. (to 106)", "170": "The Costoboci tribe invades Roman territory. Meeting little opposition, they swept through and raided the provinces of Moesia Inferior, Moesia Superior, Thracia, Macedonia and Achaea. (to 171)", "177": "Written on bronze tablets, the Roman laws of Troesmis attest the joint rule of Roman emperors Marcus Aurelius and Commodus. (to 180)", "200": "Pieporus is king over the Dacian Costoboci (see Costoboci#Onomastics)Tribal king Tarbus is mentioned by Dio Cassius without having his origin specified. Some authors consider a possible Dacian ethnicity", "260": "After the defeat and capture of Roman emperor Valerian, Dacian general Regalianus became Roman emperor for a brief period.", "271": "Roman withdrawal from Dacia occurs under Roman emperor Aurelianus after 169 years of rule. (to 275)", "305": "MayGalerius, born in Serdica  (Sofia, Bulgaria), whose mother had fled from Dacia Traiana, becomes and rules as Roman Emperor. He is also awarded six Carpicus Maximus titles after winning six battles against the Carps. Galerius died in late April or early May 311 from a horribly gruesome disease described by Eusebius and Lactantius, possibly some form of bowel cancer, gangrene or Fournier gangrene. (to 311)", "308": "Dacian-born Maximinus II (Galerius' nephew) becomes Roman Emperor. He competed with Licinius in the Civil wars of the Tetrarchy. He ruled together with other Roman Emperors as per the Civil wars of the Tetrarchy. (to 313),Licinius I, born to peasant family which had fled from Dacia Traiana, becomes Roman Emperor of the eastern part of the Roman Empire. He was the childhood friend of the Roman Emperor Galerius. (to 324)", "311": "Galerius signs the Edict of Serdica (modern day Sofia, Bulgaria) thus officially ending the Diocletianic persecution of Christianity in the East two years before the Edict of Milan being the first edict legalizing Christianity.", "313": "Shortly before Maximinus II's death at Tarsus, while previously persecuting Christians and opposing the Edict of Serdica, he issued an edict of tolerance on his own, granting Christians the rights of assembling, of building churches, and the restoration of their confiscated properties.,February", "317": "Roman emperor Constantine I the Great is awarded the title Carpicus Maximus after winning a battle against the Carps.", "March 1": " Licinius II (Licinius I's son) serves in the Eastern Roman Empire with the rank of Caesar as per the inscription \\LICINIUS IUNior NOBilissimus CAESar\\ which translates as 'Licinius Junior Most Noble Caesar'. (to 324)", "324": "Constantine I defeats Licinius I at the Battle of Chrysopolis and becomes Roman Emperor during the Civil wars of the Tetrarchy.", "325": "Licinius I is hanged by Constantine due to being accused of conspiring to raise troops among the barbarians.", "326": "Licinius II is killed by the Roman Emperor Constantine, probably in the context of the execution of Caesar Crispus.", "333": "The Itinerarium Burdigalense mentions Troesmis. (to 334)", "353": "The Roman soldier and historian Ammianus Marcellinus places the Carps as living inside the Roman Empire. (to 378)", "370": "Alaric I is born on Peuce Island, Dobruja, modern-day Romania. He later led the Goths in the Sack of Rome (410).", "381": "The Byzantine chronicler Zosimus records an invasion over the Danube by a barbarian coalition of Huns, Scirii and what he terms Karpodakai, or Carpo-Dacians, as being defeated by emperor Theodosius.", "390": "The Notitia Dignitatum mentions the presence of the commander of the Roman Legion Legio II Herculia in Troesmis.", "393": "A coin bearing the name of the Western Roman Emperor Honorius was found in a grave at Troesmis. (to 395)", "400": "Tabula Peutingeriana shows about 88 localities, the names of some of which were still Dacian at the time of its compiling as they end in -dava. 20 of them are still inhabited today, and 6 of them still retain the same name, or, incorporate their original names into their current name.A paleo-Christian basilica was discovered in Niculitel in the spot named \\La Placinta\\. Coins from between 330-354 were discovered, as were 5th century", "466": "Aethicus Ister from Histria in Dobruja finishes his trip around the world.", "500": "A 5th century burial contained a Roman type brooch.At Napoca, cross-dating using pottery remains infers a post-Roman date for the construction of a Roman styled porticus.,At Porolissum, red-slipped ware (terra sigillata Porolissensis) has been found in a post-Roman (re)construction phase of the forum.,At Potaissa, burials containing iron buckles, flint-steel, gold and silver jewelry, amber and embroidery beads have been excavated.A crypt is all that is left of a paleo-Christian basilica discovered at Tomis. Three enclosures for the remains of saints were discovered. (to 600)", "A 5th-6th century": " Christian basilica was discovered in 2012 at Noviodunum. According to the archeologist Florin Topoleanu, the population of 5th century Noviodunum was Christian. (to 600),Blachernae was a suburb of Constantinople. The Romanian philologist Ilie Gherghel, wrote a study about Blachernae and concluded that it possibly derived from the name of a Vlach (sometimes written as Blach or Blasi), who came to Constantinople from the lower Danube, a region named today Dobruja. Gherghel compared data from old historians like Genesios and from the Greek lexicon Suidas and mentioned the existence of a small colony of Vlachs in the area of today Blachernae. Similar opinions were sustained by Lisseanu.", "513": "Blachernae appeared in a work by Theophanes Confessor in connection with a revolt of Flavius Vitalianus against Anastasius I Dicorus, Emperor in 513.", "571": "A bronze coin from the time of the Eastern Roman Emperor Justin II was discovered at Troesmis. (to 573)", "587": "First written record about a Romance language spoken in Southeastern Europe", "588": "Troesmis was inhabited until 593. Byzantine coins were discovered here and dated between 588-593 during the reign of Byzantine emperor Maurice. (to 593)", "600": "Procopius mentions fortswhere? with names such as Skeptekasas, Burgulatu, Loupofantana and Gemellomountes. Modern authors claim these as Romanian names", "681": "Formation of the First Bulgarian Empire (681-1018), including the lands east and south of the Carpathians", "700": "The Ravenna Cosmography mentions Troesmis.Ananias of Shirak, a 7th-century Armenian geographer described the \\large country of Dacia\\ as inhabited by Slavs who formed \\twenty-five tribes\\.,Some authors state that Troesmis was inhabited until the end of the 7th century", "800": "Cremation cemeteries of the \\Nuffalau-Somefeni group\\ were discovered in northwestern Transylvania, with their 8th- and 9th-century tumuli.", "Ten 8th century": " graves of adults with bracelets from Troesmis were discovered in 1977.", "805": "Around 805, the Bulgarian khan Krum defeated the Avar Khaganate to destroy the remainder of the Avars, conquered Pannonia and Transilvania, spreading from the middle Danube to the Dnieper and from Odrin to the Tatra Mountains. The Ongal was the traditional Bulgar name for the area north of the Danube across the Carpathians covering Transylvania and along the Danube into eastern Pannonia. This resulted in the establishment of a common border between the Frankish Empire and Bulgaria.", "824": "The Fourth Section of the Royal Frankish Annals mentions the Abodrites who lived in \\Dacia on the Danube as neighbors of the Bulgars\\ sent envoys to Emperor Louis the Pious in 824, complaining \\about vicious aggression by the Bulgars\\ and seeking the emperor's assistance against them, according to the Royal Frankish Annals. The Abodrites inhabited the lands along either the Timis or the Tisza rivers.", "890": "Menumorut, Glad, and the Vlach Gelou are the rulers of Crisana, Banat, and Transylvania when the Magyars invaded the territoriy, according to the Gesta Hungarorum.", "900": "Fine, gray vessels were also unearthed in the 9th-century \\Blandiana A\\ cemeteries in the area of Alba-Iulia, which constitutes a \\cultural enclave\\ in Transylvania. Near these cemeteries, necropolises of graves with west-east orientation form the distinct \\Ciumbrud group\\. Female dress accessories from \\Ciumbrud graves\\ are strikingly similar to those from Christian cemeteries in Bulgaria and Moravia.", "906": "Menumorut dies and is succeeded by his son-in-law, Zolt\\u00e1n of Hungary, according to the Gesta Hungarorum.", "943": "An Old Slavonic (Old Bulgarian) inscription found among the remains of Trajan's Wall in Dobruja bears the name of \\u017eupan Demetrius.", "969": "The \\Western part\\ of Troesmis is supposed to have been rebuilt and used again during the reign of the Eastern Roman Emperor John I Tzimiskes based on archaeological discoveries.", "976": "The Greek historian John Skylitzes mentions the word \\u03b2\\u03bb\\u03ac\\u03c7\\u03bf\\u03b9 (Vlachs) in his work Synopsis of Histories.", "983": "Ibn al-Nad\\u012bm published in 938 the work Kit\\u0101b al-Fihrist mentioning \\Turks, Bulgars and Vlahs\\ (using Blagha for Vlachs)", "1000": "According to the Arab chronicler Mutahhar al-Maqdisi, \\They say that in the Turkic neighbourhood there are the Khazars, Russians, Slavs, Waladj, Alans, Greeks and many other peoples.\\,Another \\u017eupan by the name of George is possibly mentioned in an inscription in the Murfatlar Cave Complex, in Dobruja. The Complex is a relict from a widespread monastic phenomenon in a 10th century", "1010": "Coins and follis notes from Troesmis have been discovered. (to 1020)", "1018": "The \\Bl\\u00f6kumenn\\ (often identified as Vlachs) are mentioned in a later source as fighting in Kievan Rus'. (to 1019)", "1050": "The Swedish Runestone G134 mentions the ethnonym Blakumen as it recorded the death of Hr\\u00f3\\u00f0f\\u00fass who was treacherously killed by Vlachs while travelling abroad.", "1066": "Byzantine writer Kekaumenos, author of the Strategikon, described a 1066 Roman (Vlach) revolt in northern Greece.", "1100": "An 11th century", "1113": "The Russian Primary Chronicle, written in ca. 1113, recorded that nomad Hungarians drove away the Vlachs and took their lands.", "1164": "Prince Andronikos Komnenos, son of (list of byzantine emperors) John II Komnenos, was apprehended by Vlachs in his escape taking the road towards Galitza/Galicia.", "1166": "Byzantine historian John Kinnamos described Leon Vatatzes' military expedition along the northern Danube, where Vatatzes mentioned the participation of Vlachs in battles with the Magyars (Hungarians) in 1166.", "1185": "Ivan Asen I of Bulgaria and Peter II of Bulgaria, described unanimously by chronicles written in the late 12th and early 13th centuries as Vlachs, rebelled against byzantine authority and restored the Second Bulgarian Empire as co-rulers, founding the Asen dynasty.", "1196": "Kaloyan of Bulgaria, younger brother of Ivan Asen I of Bulgaria and Peter II of Bulgaria, became Emperor of Bulgaria. (to October 1207)", "1197": "Dobromir Chrysos was a leader of the Vlachs and Bulgarians in eastern Macedonia during the reign of Byzantine emperor Alexios III Angelos. According to Niketas Choniates, a 12th-century Greek byzantine government official, Dobromir was Vlach by birth.", "1200": "Benjamin of Tudela of the Kingdom of Navarre was one of the first writers to use the word Vlachs for a Romance-speaking population.", "1204": "November 8A papal legate delivered a royal crown to Kaloyan of Bulgaria and crowned him \\King of the Bulgarians and Vlachs\\.", "1213": "An army of Vlachs, Transylvanian Saxons, and Pechenegs, led by Ioachim of Sibiu, attacked the Bulgarians and Cumans that were from Vidin.", "1222": "\\u021aara Fagarasului was mentioned in documents as Terra Blacorum.", "1224": "\\u021aara Fagarasului was mentioned in documents as Silva Blacorum.", "1230": "Adventure 22 of The Nibelungenlied states that a certain Duke Ramunnch from Wallachia was present at Atilla's wedding with 700 men riding \\as swiftly as flying birds\\.", "1241": "The Persian chronicle J\\u0101mi\\u02bf al-Taw\\u0101r\\u012bkh mentions several rulers from Wallachia such as Bezerenbam and Mifelav and the country of Ilaut", "1247": "The diploma of King B\\u00e9la IV of Hungary issued on July 2, 1247 mentions the local rulers knyaz John, knyaz Farcaf, voivode Litovoi and voivode Seneslau. Seneslau and Litovoi are expressly said to be Vlachs (Olati) in the king's diploma.", "1252": "\\u021aara Fagarasului was mentioned in documents as Terra Olacorum.", "1277": "Barbat succeeds his brother Litovoi as ruler of Oltenia after the later was killed during a battle with the Hungarian army. (to 1280)", "1288": "First evidence of Diet in Transylvania.", "1290": "According to legend and the 17th century", "1300": "Simon of Keza states in his Gesta Hunnorum et Hungarorum that the Vlachs remained in Pannonia.", "1310": "Basarab I's rule starts and lasts until 1351/1352.", "1330": "Basarab I of Wallachia wins the Battle of Posada against Charles I Robert of Hungary.", "1332": "Thocomerius is named in a diploma of Charles I of Hungary as being the father of Basarab I. Certain historians such as Vlad Georgescu and Marcel Popa believe him to have been a voievode in Wallachia having succeeded Barbat who ruled around 1278.", "1340": "During the reign of Ivan Alexander of Bulgaria (1331-1371) the control over powerful vassals, such as the rulers of Wallachia and Dobruja, who pursued their own foreign policies, was hardly stronger. The Principality of Karvuna or Despotate of Dobruja split off from the Second Bulgarian Empire in the region of modern Dobruja and Northeast Bulgaria,", "1400": "Vlach settlements existed throughout much of today's Croatia, but centres of population were focused around the Velebit and Dinara mountains and along the Krka and Cetina rivers.The Flateyjarb\\u00f3k preserves the 13th century", "1437": "The Transylvanian peasant revolt broke out at Bob\\u00e2lna.", "1438": "The Unio Trium Nationum pact was signed as a reaction to the Transylvanian peasant revolt at Bob\\u00e2lna.", "1465": "October 14Radu cel Frumos issues a writ from his residence in Bucharest.", "1476": "The Polish chronicler Jan D\\u0142ugosz remarked in 1476 that Moldavians and Wallachians \\share a language and customs\\.", "1514": "Gy\\u00f6rgy D\\u00f3zsa led a peasant's revolt in Transylvania against Hungarian nobles.", "1521": "Neacsu's letter is one of the oldest surviving documents written in the Romanian language.", "1532": "Francesco della Valle writes that \\they name themselves Romei in their own language\\ (\\si dimandano in lingua loro Romei\\) and, he also cites the expression \\Do you know Romanian?\\ (\\se alcuno dimanda se sano parlare in la lingua valacca, dicono a questo in questo modo", "1534": "Tranquillo Andronico remarks that \\\\Vlachs now name themselves Romanians (Valachi nunc se Romanos vocant).", "1542": "The Transylvanian Szekler Johann Lebel wrote that \\the Vlachs name each other Romuini\\.", "1554": "The Polish chronicler Stanislaw Orzechowski mentions that \\in their language, the vlachs name themselves romini\\.", "1563": "An Acts of the Apostles book is printed by the printer Coresi from Brasov in Romanian, though written with the Cyrillic alphabet at the time.", "1570": "The Croatian Ante Veran\\u010di\\u0107 specifies that \\the vlachs from Transylvania, Moldova and Transalpina name themselves Romans\\.", "1574": "Pierre Lescalopier writes that \\those that live in Moldova, Wallachia and most of Transylvania consider themselves as being descendants of Romans and name their language romanian\\.", "1575": "Ferrante Capecci, after travelling through Wallachia, Transylvania and Moldova, mentions that the dwellers of these lands are named \\romanesci\\.", "1580": "The Orastie Palia is the oldest translation of the Pentateuch written in the Romanian language.", "1600": "Wallachian prince Mihai Viteazul briefly imposes his rule over the other two historic principalities inhabited by Romanians - Transylvania and Moldavia.", "1601": "The assassination of Mihai Viteazul ends the union between Transylvania, Moldova and Wallachia that had been established one year prior.After the assassination of Mihai Viteazu, the Hungarian-origin Transylvanian noblemen swear allegiance to Rudolph II, the Habsburg Emperor. Giorgio Basta's terror regime commences", "1605": "Stephen Bocskay becomes Prince of Transylvania guaranteeing religious freedom and broadening Transylvania's independence.", "1606": "The Treaty of Vienna gives constitutional and religious rights and privileges to all Hungarian-speaking Transylvanians but none to Romanian-speaking people. The treaty guarantees the right of Transylvanians to elect their own independent princes in the future.", "1613": "Gabriel Bethlen becomes Prince of Transylvania succeeding to Gabriel B\\u00e1thory. Under Bethlen's rule, the principality experiences a golden age. He promoted agriculture, trade, and industry, sank new mines, sent students abroad to Protestant universities, and prohibited landlords from denying an education to children of serfs", "1618": "Transylvania take part to Thirty Years' War. Gabriel Bethlen invades Hungary and proclaims himself as King of Hungary.", "1621": "On December 31, Peace of Nikolsburg ends the war between Transylvania and Habsburgs. The conditions of Treaty of Vienna signed in 1606 are reinforced.", "1632": "The first war between Wallachia, led by Matei Basarab, and Moldavia led by Vasile Lupu.", "1640": "Grigore Ureche, in his The Chronicles of the land of Moldavia states that the language spoken by Moldavians is an amalgam of Latin, French, Greek, Polish, Turkish, Serbian, and so on, though assuming the preponderance of the Latin influence and claims that, at a closer look, all Latin words could be understood by Moldavians.", "1648": "Peace of Westphalia ends the Thirty Years' War. Transylvania is mentioned as a sovereign state.", "1653": "The second war between Matei Basarab and Vasile Lupu ends with the Moldavian throne being given to Gheorghe etefan.", "1655": "Seimeni revolt begins.", "1657": "George II R\\u00e1k\\u00f3czi invades Poland only to be defeated. The Ottoman Empire take advantage of the new situation and restore the military power in Transylvania.", "1661": "In April Prince Kem\\u00e9ny proclaims the secession of Transylvania from the Ottomans and appeals to help from the Habsburg Monarchy. He was not aware of the secret agreement between the Habsburg Empire and Ottomans and the move will end his reign. Transylvania becomes a vassal state of the Ottoman Empire.", "1682": "The capital of Transylvania is moved to Sibiu (then Nagyszeben);", "1683": "The defeat of Ottoman armies in Battle of Vienna means the end of Ottoman rule over Transylvania. The Roman Catholic Church becomes official church in Transylvania in a move directed by the Habsburgs to weak the noblemen estates, which were both Roman Catholic and Protestant.", "1692": "The Habsburgs control over Transylvania is consolidated even more and the princes are replaced with governors named directly by the Habsburg Emperors, who themselves become Princes of Transylvania.", "1698": "Bucharest becomes capital of Wallachia. Until then the capital was in T\\u00e2rgoviste. Constantin Br\\u00e2ncoveanu's 16-year reign commences during which period Wallachia enjoys a golden age.", "1699": "The Emperor Leopold I decrees Transylvania's Orthodox Church to be one with the Roman Catholic Church, by joining the newly created Romanian Greek-Catholic Church.Martinus Szent-Ivany mentions that the Vlachs use the following phrases \\Si noi sentem Rumeni\\ meaning \\we are Romanians too\\ and \\Noi sentem di sange Romena\\, meaning \\We are of Roman blood\\.", "1711": "Transylvania's direct-autonomy to Habsburg Empire ends, as the region comes under the administrative area of Hungary.", "1714": "Constantin Br\\u00e2ncoveanu and his sons are executed in Istanbul at the order of Sultan Ahmed III because they did not renounce their Christian faith. The sultan also did not agree with Br\\u00e2ncoveanu's alliance with the Habsburg and Russian empire.", "1715": "The Phanariote period starts. Nicholas Mavrocordatos becomes the first Phanariote prince of Wallachia. The influence of Ottoman Empire is greater than ever.", "1716": "The Habsburg Empire invades Wallachia during the Austro-Turkish War.41718", "1739": "Oltenia is reconquered by the Ottomans.", "1746": "Constantine Mavrocordatos abolishes enacts measures effectively abolishing serfdom in Wallachia and creates a more effective central administrative apparatus.", "1749": "Serfdom is abolished in Moldavia.", "1765": "The Grand Principality of Transylvania is proclaimed, consisting of a special separate status within the Habsburg Empire originally granted in 1691. This was however just a mere formality, as Transylvania is still an administrative area of Hungary.", "1768": "Wallachia is occupied by Russia during the Fifth Russo-Turkish War.", "1784": "The Revolt of Horea, Clofca and Crifan starts in November and lasts until February in 1785. The main demands were related to the existence feudal serfdom and the lack of political equality between Romanians and other ethnicities of Transylvania.", "1791": "Romanian-speaking Transylvanians petition to Emperor Leopold II for recognition as the fourth nation of Transylvania and for religious equality. Their demands are rejected and their old marginalised status is reinforced;", "1801": "Russia assumes a protective right over Romanian-speaking Christians in the Danubian lands and soon began to increase its influence in the region.", "1802": "S\\u00e1muel Teleki, then Chancellor of Transylvania, inaugurates the first library in Transylvania and present-day Romania. On December 15, J\\u00e1nos Bolyai is born in Cluj Napoca. Today the town's main university is named after him and Victor Babef.", "1806": "Following the collapse of the Holy Roman Empire, the Habsburg Empire is reorganised and becomes the Austrian Empire.Wallachia is occupied by Russia.,1813", "1817": "Mihail Kogalniceanu is born. He will play a major role in the politics of Romania in second half of the 19th century", "1818": "Ion Caragea adopts the first modern code of law in Wallachia.", "1821": "Following the death of Alexandros Soutzos a boyar regency is established.The anti-boyar and anti-Phanariote uprising takes place being led by Tudor Vladimirescu. On 28 May, a treaty is signed between Russian Empire and the Ottoman Empire ending the war with Bessarabia becoming part of the Russian Empire.The Phanariote rule ends. Moldavia is occupied by Alexander Ypsilantis's Filiki Eteria during the Greek War of Independence.", "1822": "Ionica Tautu, representing a group of low-ranking boyars in Moldavia, proposes a constitutional project with republican and liberal principles;", "1826": "Local leaders in Moldavia are allowed to govern by the Ottoman Empire and Russian Empire.", "1829": "Following the Treaty of Adrianople, without overturning Ottoman suzerainty, places Wallachia and Moldavia under Russian empire military rule until Turkey pays an indemnity. Wallachia gains the rayas of Turnu, Giurgiu and Braila, Russia annexes the Danube estuary.The seventh Russo-Turkish War brings Pavel Kiselyov at the leadership of Moldavia.", "1834": "Regulamentul Organic, a quasi-constitutional organic law is enforced in Wallachia and Moldavia. Sfatul Boieresc, the first Legislative Assembly in Wallachia is established.Regulamentul Organic, a quasi-constitutional organic law is enforced in Wallachia and Moldavia. Sfatul Boieresc, the first Legislative Assembly in Wallachia is established Mihail Sturdza, a man with unionist ideas, becomes Prince of Moldavia.", "1844": "The enslavement of Romani people ends.", "1847": "A custom unionclarification needed with Wallachia is established.", "1848": "The Revolution are very active in this part of Europe. The Hungarians demand more rights, including a provision on the union between Transylvania and Hungary. The Romanian-speaking Transylvanians carry their own parallel revolution led by Avram Iancu, which opposed the union with Hungary.,The Revolutions of 1848 spreads in Wallachia where the Romanian-speaking Wallachians try to overrule the Russian Empire's administration, demand the abolition of boyar privilege and a land reform. The revolutionaries are successful enough to create a provisional government in June and forced Gheorghe Bibescu, the Prince of Wallachia, to abdicate and leave into exile. A series of reforms follow the protests, the abolition of Roma slavery being one of them.,The Revolutions of 1848 reach Moldavia but are less successful than in Wallachia, as the revolts are quickly suppressed.,1849", "1850": "Mihai Eminescu, regarded todayby whom? as the most famous and influential Romanian poet is born.", "1854": "The first railway line through Romania's present-day territory opens on August 20 and between Oravi\\u0163a in Banat and Baziaf.The Russian Empire protectorate ends. It is followed by an Ottoman occupation for several months and then a two-year-long Austrian occupation;", "1856": "Wallachia and Moldavia are brought under the influence of the Western European powers under the provisions of the Treaty of Paris.The end of the Crimean War heralds the end of Russia dominance in Moldovia.", "1859": "The National Party is founded. Its leader, Alexandru Ioan Cuza will play a major role in the formation of Romania just three years later.Alexandru Ioan Cuza is elected Prince of Moldavia on January 5. Three weeks later he is also elected Prince of Wallachia, thus achieving a de facto union of the two principalities under the name of Romania.", "1860": "University of Iafi is established, as the first institution of higher education in Romanian language with faculties of literature, philosophy, law, science and medicine and schools in music and art. The Romanian Army is founded. Romania switches from Cyrillic script to the Latin script that is still in use today.", "1861": "On February 5, the 1859 union is formally declared and a new country, Romania is founded. The capital city is chosen to be Bucharest. On December 23, Abd\\u00fclaziz, the Sultan of the Ottoman Empire officially recognizes the union but only for the duration of Cuza's reign.The Transylvanian Association for the Literature and Culture of the Romanians is founded in Sibiu, as the first cultural association of the Romanian-speaking Transylvanians.", "1862": "The Government of Romania is formed with Alexandru Constantin Moruzi as the first ever Prime Minister.", "1863": "Alexandru Ioan Cuza promulgates the Agrarian Reform in which the majority of the land is transferred into the property of those who worked it. As there was not enough land, the Secularization of monastery estates in Romania, in which large estates owned by the Romanian Orthodox Church are transferred under state ownership and than to private property, takes place. This was an important turning point in the history of Romania, as it marked the almost disappearance of the Boyar class, leaving the country to look towards capitalism and industrialization.", "1864": "The Parliament of Romania is formed. A tuition-free, compulsory public education for primary schools is introduced in Romania for the first time. Also a Criminal Code and a Civil Code, both based on the Napoleonic Code, are introduced.", "1865": "On January 1, Casa de Economii fi Consemna\\u0163iuni, the first bank of Romania, is established. On June 19 Evangelis Zappas, one of the richest men in the world at that date dies at the age of 65. Born in the Ottoman Empire in today's Greece he lived in Romania most of his life.,Romania becomes the first European country to abolish the death penalty. This, however, did not last, it is now abolished in Romania since 1990.", "1866": "On February 22, Alexandru Ioan Cuza is forced to sign his abdication, which was mainly caused by the Agrarian Reform from 1863 that made him many enemies. Due to the country's political troubles and its financial collapse, the Parliament takes the decision to place a foreign price on the vacant throne. On March 26, Karl of Hohenzollern-Sigmaringen becomes Prince of Romania as Carol. Originally, the offer was made to Prince Philippe, Count of Flanders but he refused. On April 1, the Romanian Academy is established. On July 1, the first constitution of Romania is ratified", "1867": "On April 22 the Leu currency is adopted.,Austria-Hungary is formed as a result of the Austro-Hungarian Compromise to replace the Austrian Empire. Transylvania becomes integrated part of Hungary.", "1869": "The Bucharest - Giurgiu railway works are concluded after four years and the line become the first of this kindclarification needed in Romania. However, it is not the first railway built on the present territory of Romania. The first railway was built in 1854 in Banat.", "1870": "The short-lived Republica Ploiefti is formed in the city of Ploiefti as part of a revolt against the Prince.", "1877": "On April 16, Romania and the Russian Empire sign a treaty under which Russian troops are allowed to pass through Romanian territory, with the condition to respect the integrity of Romania. On 21 May, the Parliament of Romania declare the independence of the country. In the fall Romania join the Russo-Turkish War on the Russian Empire side. In November, deeply defeated in the Battle of Plevna, the Ottoman Empire request an armistice.", "1878": "Romania independence is recognised by the Central Powers on July 13. Following the Treaty of Berlin, Romania now include territories of Northern Dobruja, the Danube Delta, and Insula eerpilor. In return the southern counties of Bassarabia are returned to Russian Empire.", "1880": "National Bank of Romania is established in April. The bank's first governor was Eugeniu Carada. Caile Ferate Rom\\u00e2ne, Romania's state-owned railway company starts its operations.", "1881": "March 26Carol I is crowned as King. His wife Elisabeth becomes Queen. Romania becomes kingdom.12 May The National Party of Romanians in Transylvania is formed as the first party of the Romanians in Transylvania.August 19 George Enescu is born.", "1882": "The Stock Exchange opens in Bucharest.", "1884": "The first ever telephone in Romania is installed.", "1885": "Patriarch Joachim IV signs the recognition of the autocephalous status of the Romanian Orthodox Church that granted it equal rights with those of the other orthodox churches.", "1886": "The construction of the Athenaeum begins. Although the work would continue until 1897, the first concert took place in 1886 and it was performed by Bucharest Philharmonic Orchestra.", "1889": "Mihai Eminescu dies aged 39.", "1892": "The Transylvanian Memorandum is signed by the leaders of the Romanians to the Austro-Hungarian Emperor Franz Joseph, asking for equal ethnic rights with the Hungarians, and demanding an end to persecutions and Magyarization attempts. The memorandum was forwarded to the Hungarian Parliament and the results was that the Romanian leaders are sentenced to long terms in prison.", "1894": "Leaders of the Transylvanian Romanians who sent a Memorandum to the Austrian Emperor demanding national rights for the Romanians are found guilty of treason.", "1895": "King Carol I Bridge is inaugurated on September 26. At the time it was the longest in Europe and second longest in the world.", "1896": "The construction of Port of Constan\\u0163a begins. Since then it has been the most important port in Romania. In May, cinema arrives in Romania for the first time.", "1897": "Bram Stoker publishes his most famous novel, Dracula, whose titular character is based on Vlad Tepes, a Romanian ruler.", "1900": "The Post Palace is inaugurated. Today it houses the National Museum of Romanian History.", "1904": "The first refinery, a Romanian-American joint venture is founded and to process oil produced in the Prahova River valley.", "1906": "Traian Vuia Achieved a short hop of 20 Meters at 1 Meter height in his aircraft Vuia I.Aurel Popovici, a Transylvanian lawyer and politician, proposes the federalization of the Austro-Hungarian monarchy into the so-called United States of Greater Austria under the model of United States of America with a total of 15 component states, Transylvania being one of them.", "1907": "Violent peasant revolts crush throughout Romania, thousands of persons killed.", "1913": "At the end of the Balkan Wars, Romania acquire the southern part of the Dobruja from Bulgaria.April 1 The Parliament votes to enact the law of the military aviationclarification needed, Romania being the fifth nation in the world to have an air force.", "1914": "October 10Carol I dies and is succeeded by his nephew, Ferdinand, who becomes the second King of Romania as Ferdinand I. His wife, Maria becomes queen.,Transylvania enters World War I on the Austro-Hungarian side.", "1916": "Despite choosing to stay away from the war, the death of King Carol I and the course of events made Romania to change its view and decide to switch sides in favor of the Entente, demanding the territory of Transylvania. The demands of the Romanian Government were accepted and following the First Treaty of Bucharest. Romania declare war to the Central Powers on August 27 and launches attacks through the Southern Carpathians and into Transylvania. Poorly trained and equipped, the Romanian Army cannot face the power of the German, Bulgarian and Ottoman armies and Bucharest is lost in December. Iafi becomes temporarily the capital city of Romania.", "1917": "August 6The Battle of Marafefti, the retreat of the Russian Army from Romania left the Romanians no choice but to ask for peace. (to September 8)", "1918": "In January USA President Woodrow Wilson requests autonomy for the ethnic groups of Austria-Hungary. Between March 26 and 28 a Congress of Nationalities of Austria-Hungary takes place in Rome when a motion is passed, demanding the recognition of the right of each nation to constitute into a national state, which would stay independent, or would unite with its already existing national state. On December 1 the assembly of the delegates of ethnic Romaniansclarification needed held in Alba Iulia declare the Union of Transylvania with Romania.The Second Treaty of Bucharest is signed on 7 May. However, after a successful offensive by the Entente on the Thessaloniki front puts out of the war, Romania re-enters the war on November 10. On November 28 the Romanian representatives of Bucovina voted for union with the Kingdom of Romania, followed by the proclamation of the union of Transylvania with the Kingdom of Romania on December 1, by the representatives of Transylvanian Romanians and of the Transylvanian Saxons gathered at Alba Iulia. Both proclamations were not, however, yet recognized by the Entente powers.", "1919": "B\\u00e9la Kun, the leader of the Hungarian Soviet Republic, decides to attack Romania to regain the lost territories in Transylvania without any success. The counter-offensive led to the occupation of the Hungarian capital Budapest in August by the Romanian Army putting an end to the self-proclaimed Hungarian Soviet Republic. In meantime, the union proclamations of Bucovina, Basarabia and Transylvania are officially recognized by the Treaty of Versailles and later by the Treaty of Trianon and the Kingdom of Romania expands its borders.", "1920": "January 20Romania becomes a founding member of League of Nations. The CFRNA (French-Romanian Company for Air Navigation) is established, becoming the first airline in Romania.", "1921": "April 23Romania and Czechoslovakia sign a peace treaty in Bucharest. It will be followed by a similar treaty between Romania and Yugoslavia signed it Belgrade one month later. A new land reform takes place, suggested by King Ferdinand I, who wanted to repay the soldiers and their families for sacrifices made during the war.", "1922": "King Ferdinand I and Queen Maria are crowned in Alba Iulia as King and Queen of all Romanians.", "1925": "The Romanian Orthodox Church is officially recognizedclarification needed.", "1927": "July 20King Ferdinand I dies and Mihai I, his grandson, becomes the third King of Romania after his father Carol renounced to his rights to the throne in two years earlier.July 24", "1929": "The worldwide Great Depression affects Romania as well.", "1930": "JuneCarol II returns to Romania on June 7 and is proclaimed King one day later, thus becoming the fourth King of Romania and the first born in Romania. The Societatea Anonima Rom\\u00e2na de Telefoane is established and Romania starts to use landline telephone on a wide scale.", "1933": "DecemberOn December 10, Ion Duca, Prime Minister of Romania at the time, bans the Iron Guard. On December 29, Ion Duca is assassinated by members of the paramilitary organization.", "1937": "A new palace is built to replace the old residence of the heads of states of Romania, which has been in use for over a century. Today the National Museum of Art of Romania is located in the palace.", "1938": "In a bid for political unity against the fascist movement known as the Iron Guard, which was gaining popularity, Carol II dismissed the government headed by Octavian Goga. The activity of the Romanian Parliament and of all political parties was suspended and the country is governed by royal decree. Miron Cristea, the first Patriarch of the Romanian Orthodox Church become Prime Minister on February 11.", "1939": "Nazi Germany and the Soviet Union sign the Molotov-Ribbentrop Pact, in which the Soviet side claims Basarabia. The territory is given to the Soviet Union together with the northern part of Bucovina one year later.", "September 21": "Armand Calinescu, Prime Minister of Romania, is assassinated by the Iron Guard.", "1940": "On June 27, following an ultimatum issued by the Soviet Union, Romania loses Basarabia. On August 30, under the Second Vienna Award, Romania loses the northern part of Transylvania to Hungary. Only one week later the Kadrilater/Southern Dobruja is lost to Bulgaria. On September 4, Horia Sima, leader of the Iron Guard, and Ion Antonescu, a Romanian Army General, Prime Minister of Romania at that date, form the \\National Legionary State\\ in Romania, forcing the abdication of King Carol II. Mihai I becomes king for the second time two days later. On October 8, Nazi troops begin crossing into Romania. On November 23, Romania joins the Axis Powers.", "1941": "January 21A rebellion organized by the Iron Guard takes place in Bucharest. Later known as the Bucharest pogrom, it was a reaction to the decision made by Ion Antonescu to cut off the privileges of the Iron Guard. During the rebellion, 125 Jews and 30 army soldiers were killed. After order is restored, the Iron Guard is banned. (to January 23)June 22Romania joins Operation Barbarossa, attacking the Soviet Union hoping to recover the lost territories of Basarabia and Bucovina. Later, Romania annexes Soviet lands immediately east of the Dnister.", "1943": "Romania becomes a target of Allied aerial bombardment.", "1944": "On August 23, King Mihai leads a successful coup with support from opposition politicians and the army. Ion Antonescu is arrested. On September 12, an Armistice Agreement is signed with the Allied powers. Romania join the Allied powers. In October Winston Churchill, Prime Minister of the United Kingdom, proposed an agreement with Soviet dictator Joseph Stalin on how to split up Eastern Europe into spheres of influence after the war. The Soviet Union were offered a 90% share of influence in Romania. Battle of Romania begins.", "1945": "On March 1, Petru Groza becomes the first Communist Prime Minister of Romania after Nicolae Radescu was forced to submit his resignation by the Soviet Union's deputy People's Commissar for Foreign Affairs, Andrei Y. Vishinsky. Later on that year Romania takes part in the Battle on Budapest as well as the Battle on Prague. Despite joining only the Allies only in August 1944, Romania had an important contribution to shortening WWII by six months, according to Sir Winston Churchillverification needed.", "1946": "The Romanian Communist Party wins the elections amid unrest and allegations of electoral fraud by opposition groups and the government of the United Kingdom.", "1947": "Following the abdication of Mihai I, the People's Republic of Romania is declared on December 30 against the majority of people who supported the monarchy. The new leader of Romania becomes Gheorghe Gheorghiu-Dej, General Secretary of the Romanian Communist Party;", "1948": "A new constitution is ratified on April 13. Two months later, on June 11 all banks and major enterprises are nationalized. During the year, also in the years to come, many pre-war politicians, businessmen, priests and even ordinary people are thrown in prisons. On August 30, following the model of Soviet NKVD, the Romanian secret police is formed;", "1949": "A forced collectivization, in which the agriculture is organized under the socialist model, comes into force. Romania join Comecon. The construction of Danube-Black Sea Canal starts. The canal was the most known labour camp in the history of Romania;", "1951": "During the night of June 18 the third-largest mass deportation in modern Romanian history takes place. Some 45,000 people are taken from their homes and deported to the Baragan plain;", "1952": "The Hungarian Autonomous Province, the one and only autonomous province in modern Romania, is created. It will be disestablished in 1968. The second Communist constitution is ratified;", "1953": "The Danube-Black Sea Canal is halted and the labour camp disestablishedied Iuliu Maniu dies in Sighet prison;", "1954": "SovRoms, joint ventures between Romania and Soviet Union are formed. They will prove their inefficiency for Romania from the first day of establishment and most of them will be dissolved in 1956;", "1955": "Romania joins the Warsaw Pact. On February 14, a group of Romanian anti-Communists occupies the Romanian embassy in Berne demanding the release from prisons of many public personalities. With the help of the Swiss police, the order is re-established two days later. On December 14, Romania join the United Nations;", "1956": "On October 28 a radio station calling itself \\Romania of the future. The voice of resistance\\ begins broadcasting on different wavelengths. Many protests, especially amongst students, follows in November. On December 31, Televiziunea Rom\\u00e2na start to broadcast first programmes;", "1957": "ARO is established in C\\u00e2mpulung-Muscel and start to manufacture off-road vehicles. ARO IMS become the first car built in Romania after World War II. Over the next three decades ARO will be a landmark of Romania.", "1958": "The Soviet Union Army leave Romania after fourteen years of occupation;", "1959": "On July 28, the Ioanid Gang carries out the most famous bank robbery ever to occur in a Communist state;", "1960": "Oliviu Beldeanu, the leader of the group that occupied the Romanian embassy in Bern five years earlier, is executed in Bucharest;", "1965": "On March 19, Gheorghe Gheorghiu-Dej dies and Nicolae Ceaufescu is elected General Secretary of the Romanian Communist Party and becomes the state leader. The official name of the country is changed into The Socialist Republic of Romania. The third Communist constitution is ratified;", "1966": "Intreprinderea de Autoturisme Pitefti is established. Two years later Romania start the mass production, the first mass production of a car - Dacia 1100. Nicolae Ceaufescu orders that the abortion decree signed in 1957 to be reversed and new policies to increase birth rate and fertility rate are introduced. The policy fails, as the population begins to swell, accompanied by rising poverty and increased homelessness children in the urban areas;", "1968": "Romania refuse to participate in the invasion of Czechoslovakia. Nicolae Ceaufescu openly condemns the action, thus he becomes a Western world favourite. Richard Nixon's visit to Romania was the first by an American president to a Communist country. The Patriotic Guards are formed as an additional defence force in case of an attack from the outside;", "1972": "In order to develop a \\multilaterally socialist society\\, Nicolae Ceaufescu starts urban planning, following the ideologies of North Korea. The face of the country is completely changed in the years to come;", "1974": "Nicolae Ceaufescu becomes the first President of Romania. Romania become the first country in the Eastern Bloc ever to establish economic relations with the European Community. The Generalised System of Preferences is signed, followed by an Agreement on Industrial Products in 1980.", "1976": "At the age of 14, Nadia Comaneci becomes one of the stars of the 1976 Summer Olympics in Montreal. During the team portion of the competition, her routine on the uneven bars is scored at a 10.0. It is the first time in modern Olympic gymnastics history that the score had ever been awarded. Over the next years, Nadia will become one of the best known Romanians in the world;The Danube-Black Sea Canal project restarts;", "1977": "On 4 March 21", "1978": "Ion Mihai Pacepa, a senior officer in Securitate, defected to the United States becoming the highest ranking defector from the Eastern Bloc;", "1980": "Construction of the Cernavoda Nuclear Power Plant begins. The fourth Communist constitution is ratified;", "1981": "The 1981 Summer Universiade becomes the most important sport event ever to be hosted by Romania. Dumitru Prunariu becomes the first Romanian in space;", "1983": "As part of the urban planning programme, significant portions of the historic centre of Bucharest are demolished in order to accommodate standardized apartment blocks and government buildings, including the grandiose Centrul Civic and the palatial House of the People, the second largest government building in the world;", "1984": "Romania is, alongside People's Republic of China and Yugoslavia, one of the three Communist countries to take part to the 1984 Summer Olympics in Los Angeles, USA. The Danube-Black Sea Canal is finally completed after nearly four decades;", "1986": "On 7 May, Steaua Bucuresti win the European Cup and become the first football team from a Communist country to win the trophy;", "1987": "In a climate of economic depression and food shortages a rebellion erupts on November 15 in the city of Brafov. Over 300 protesters are arrested for hooliganism.", "1989": "On December 16, protests break out in Timisoara. Five days later Nicolae Ceausescu organises a mass meeting in Bucharest. The jeers and whistles soon erupt into a riot, as the crowd takes to the streets, placing the capital in turmoil. Nicolae Ceausescu and his wife leave Bucharest putting an end to four decades of Communist rule in Romania. On December 25, after a short trial, Nicolae Ceaufescu and his wife are executed.The National Salvation Front (FSN) take the power during the Romanian Revolution. The leader is elected Ion Iliescu. The new name of the republic becomes Romania;", "1990": "On 20 May, free elections are held in Romania for the first time after fifty years. FSN, which became a political party, win the elections. Ion Iliescu is elected the second President of Romania. Before and after the elections, a protest initiated by the students and professors of University of Bucharest, which was also supported by many intellectuals, demanded that former members of the Romanian Communist Party, which included Ion Iliescu, should be banned from elections. The protest was ended by the intervention of the miners from Jiu Valley, brought to Bucharest by Iliescu himself in what is remembered as the June 1990 Mineriad;", "1991": "A new constitution is ratified;", "1992": "Elections are held and Ion Iliescu wins a second mandate. Privatization of the industry starts;", "1993": "Romania apply to become a member of the European Union. The first wireless telephony system becomes active;", "1995": "The Stock Exchange reopens in Bucharest;", "1996": "Emil Constantinescu becomes the third President of Romania;", "1997": "Romania join the countries able to use GSM telephony;", "2000": "Ion Iliescu returns to power after winning the elections;", "2004": "Romania joins the North Atlantic Treaty Organization. Traian Basescu becomes the fourth President of Romania.", "2007": "On January 1, Romania join the European Union, together with Bulgaria. Traian Basescu was temporarily suspended for alleged constitutional violations and replaced with Nicolae Vacaroiu.", "2008": "In February the Government overrule court decision that commission investigating Communist-era secret police is illegal. For two days, starting on April 2, Romania host 2008 NATO summit. Legislative election are held on November 30. Emil Boc becomes the new Prime Minister following the elections.", "2009": "Badly affected by the Late-2000s recession, the International Monetary Fund and other lenders agree to provide Romania a rescue package worth 20bn Euros. A Government crisis begins in April when the Social Democratic Party pulls out of ruling coalition, leaving Prime Minister Emil Boc at head of minority government, which subsequently loses a confidence vote in parliament. On December 6, Traian Basescu is re-elected as president for a second mandate after marginally winning the presidential election in front of Mircea Geoana.", "2013": "Large protests against Prime Minister Victor Ponta. (to 2014)", "2014": "December 21Klaus Iohannis becomes the fifth President of Romania, who is also the first ethnic German President of Romania."}